# connect-processor - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/connect_processor_customer_v1_event]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/connect_processor_customer_v1_event-retry-0]
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role.lambda_role: Refreshing state... [id=lambda-execution-connect_processor_customer_v1_event]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role.lambda_role: Refreshing state... [id=lambda-execution-connect_processor_customer_v1_event-retry-0]
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Read complete after 1s [id=upstash_kafka_credential_secret_name]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 1s [id=upstash_kafka_cluster_id]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Reading...
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=cockroachdb_serverless_cluster_id]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 1s [id=upstash_kafka_cluster_credential_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=a27f5636-438f-4b19-b110-9d75fb1c2982:connect_processor]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.archive_file.default: Read complete after 2s [id=77da09f6c1e72372854765c52dc750fd91625857]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-connect_processor_customer_v1_event-retry-0-20230525091623555200000001]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-connect_processor_customer_v1_event-20230525054605551700000001]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.archive_file.default: Read complete after 2s [id=77da09f6c1e72372854765c52dc750fd91625857]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:064003852748:secret:upstash_kafka_credential_542599-Wf1ZwL]
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_customer_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=1678494158]
module.common_resources.module.aws_lambda_customer_v1_event.aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=lambda-execution-connect_processor_customer_v1_event:lambda-secrets-policy-connect_processor_customer_v1_event]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=1678494158]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=lambda-execution-connect_processor_customer_v1_event-retry-0:lambda-secrets-policy-connect_processor_customer_v1_event-retry-0]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-b8487336-854b-451c-8fc9-94888c7b9920]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 0s [id=upstash-kafka-credential-f9f7c577-70dc-48cf-b92a-8e78f4e7ba53]
module.common_resources.module.aws_lambda_customer_v1_event.aws_lambda_function.default: Refreshing state... [id=connect_processor_customer_v1_event]
module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_lambda_function.default: Refreshing state... [id=connect_processor_customer_v1_event-retry-0]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_retry_topics[0]: Refreshing state... [id=3e43c1e7-805e-4ba8-bf5c-d24562992526]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_topic: Refreshing state... [id=8b881484-64cb-4556-955b-1c4b078f1dd1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_customer_v1_event_retry_topics[0] will be updated in-place
  ~ resource "aws_lambda_event_source_mapping" "kafka_trigger_customer_v1_event_retry_topics" {
      ~ function_name                      = "arn:aws:lambda:us-east-1:064003852748:function:connect_processor_customer_v1_event-retry-0" -> "connect_processor_customer_v1_event_retry_0"
        id                                 = "3e43c1e7-805e-4ba8-bf5c-d24562992526"
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_customer_v1_event.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "connect_processor_customer_v1_event"
        tags                           = {
            "domain"        = "connect"
            "environment"   = "production"
            "resource"      = "connect-processor"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "growing-manatee-9600-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "0530d124acdb4f93827d8c855a8495d8"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "Z3Jvd2luZy1tYW5hdGVlLTk2MDAkV03Y9Mt_Nt3bGXzoyjKDvNOcBz3mi9198U0"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_cloudwatch_log_group.default must be replaced
-/+ resource "aws_cloudwatch_log_group" "default" {
      ~ arn               = "arn:aws:logs:us-east-1:064003852748:log-group:/aws/lambda/connect_processor_customer_v1_event-retry-0" -> (known after apply)
      ~ id                = "/aws/lambda/connect_processor_customer_v1_event-retry-0" -> (known after apply)
      ~ name              = "/aws/lambda/connect_processor_customer_v1_event-retry-0" -> "/aws/lambda/connect_processor_customer_v1_event_retry_0" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "domain"        = "connect"
            "environment"   = "production"
            "resource"      = "connect-processor"
            "resource_type" = "lambda"
        }
        # (3 unchanged attributes hidden)
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role.lambda_role must be replaced
-/+ resource "aws_iam_role" "lambda_role" {
      ~ arn                   = "arn:aws:iam::064003852748:role/lambda-execution-connect_processor_customer_v1_event-retry-0" -> (known after apply)
      ~ create_date           = "2023-05-25T09:16:23Z" -> (known after apply)
      ~ id                    = "lambda-execution-connect_processor_customer_v1_event-retry-0" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> (known after apply)
      ~ name                  = "lambda-execution-connect_processor_customer_v1_event-retry-0" -> "lambda-execution-connect_processor_customer_v1_event_retry_0" # forces replacement
      + name_prefix           = (known after apply)
      ~ role_last_used        = [
          - {
              - last_used_date = ""
              - region         = ""
            },
        ] -> (known after apply)
        tags                  = {
            "domain"        = "connect"
            "environment"   = "production"
            "resource"      = "connect-processor"
            "resource_type" = "lambda"
        }
      ~ unique_id             = "AROAQ5ZXNJHGA6KIQHGQI" -> (known after apply)
        # (5 unchanged attributes hidden)

      - inline_policy {
          - name   = "lambda-secrets-policy-connect_processor_customer_v1_event-retry-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "secretsmanager:GetSecretValue"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:secretsmanager:us-east-1:064003852748:secret:upstash_kafka_credential_542599-Wf1ZwL"
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0] must be replaced
-/+ resource "aws_iam_role_policy" "lambda_secrets_policy" {
      ~ id     = "lambda-execution-connect_processor_customer_v1_event-retry-0:lambda-secrets-policy-connect_processor_customer_v1_event-retry-0" -> (known after apply)
      ~ name   = "lambda-secrets-policy-connect_processor_customer_v1_event-retry-0" -> "lambda-secrets-policy-connect_processor_customer_v1_event_retry_0" # forces replacement
      ~ role   = "lambda-execution-connect_processor_customer_v1_event-retry-0" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_iam_role_policy_attachment.default must be replaced
-/+ resource "aws_iam_role_policy_attachment" "default" {
      ~ id         = "lambda-execution-connect_processor_customer_v1_event-retry-0-20230525091623555200000001" -> (known after apply)
      ~ role       = "lambda-execution-connect_processor_customer_v1_event-retry-0" -> "lambda-execution-connect_processor_customer_v1_event_retry_0" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.aws_lambda_customer_v1_event_retry[0].aws_lambda_function.default must be replaced
-/+ resource "aws_lambda_function" "default" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:064003852748:function:connect_processor_customer_v1_event-retry-0" -> (known after apply)
      ~ function_name                  = "connect_processor_customer_v1_event-retry-0" -> "connect_processor_customer_v1_event_retry_0" # forces replacement
      ~ id                             = "connect_processor_customer_v1_event-retry-0" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:064003852748:function:connect_processor_customer_v1_event-retry-0/invocations" -> (known after apply)
      ~ last_modified                  = "2023-05-25T09:16:39.728+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:064003852748:function:connect_processor_customer_v1_event-retry-0:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:064003852748:function:connect_processor_customer_v1_event-retry-0:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::064003852748:role/lambda-execution-connect_processor_customer_v1_event-retry-0" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 17107822 -> (known after apply)
        tags                           = {
            "domain"        = "connect"
            "environment"   = "production"
            "resource"      = "connect-processor"
            "resource_type" = "lambda"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (11 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "growing-manatee-9600-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "0530d124acdb4f93827d8c855a8495d8"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "Z3Jvd2luZy1tYW5hdGVlLTk2MDAkV03Y9Mt_Nt3bGXzoyjKDvNOcBz3mi9198U0"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "connect"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "connect_processor"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "a27f5636-438f-4b19-b110-9d75fb1c2982:connect_processor"
        name       = "connect_processor"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "3602b3be-1fc2-415d-b6ec-0e9a3666a8fd" -> "ff447640-5142-436d-b53a-af2f2f27ab72"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 6 to add, 3 to change, 6 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*